# Introdução à Data Science com Python - Data ICMC-USP

Esse material foi desenvolvido pelo Data, grupo de extensão de aprendizado e ciência de dados compostos por alunos do Instituto de Ciências Matemáticas e de Computação da USP.

Esse notebook é acompanhado de um curso em video, que pode ser encontrado em [aqui](https://www.youtube.com/playlist?list=PLFE-LjWAAP9SfEuLXf3qrpw4szKWjlYq9)

Para saber mais sobre as atividades do Data entre no nosso site e nos siga e nossas redes sociais:
- [Site](http://data.icmc.usp.br/)
- [Twitter](https://twitter.com/data_icmc)
- [LinkedIn](https://www.linkedin.com/school/data-icmc/)
- [Facebook](https://www.facebook.com/dataICMC/)

Aproveite o material!


## Pandas

Pandas é uma biblioteca para manipulação de dados tabelados. Possuindo várias funções para manipular arquivos `.csv`, `.xls`, `.json`, entre outros. Pandas tem uma integração natural com NumPy, além de possuir um funcionamento análogo em vários sentidos. Assim como NumPy a biblioteca também é bem completa, então iremos passar pelos conceitos básicos e é muito recomendado conferir a documentação oficial em https://pandas.pydata.org/docs/

In [2]:
import numpy as np
# É comum importar pandas como pd
import pandas as pd

### Leitura de arquivos

Dados podem vir em arquivos com diferentes formatos, e para a maioria deles o Pandas fornece alternativas para sua leitura. Vamos trabalhar com arquivos `.csv` no decorrer do curso, pois é o tipo mais comum de arquivo.

In [3]:
# Assim que fazemos a leitura de arquivos csv
df = pd.read_csv('data/titanic.csv')

In [3]:
# Vamos ver o tipo desse dado que acabamos de ler
type(df)

pandas.core.frame.DataFrame

### DataFrame

Um DataFrame é o principal elemento do Pandas. Ele é basicamente a representação de uma planilha/tabela, porém com muitas funções que permitem inspeção e manipulação.

In [50]:
# Podemos observar as primeiras linhas do DataFrame com .head()
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
# DataFrames possuem shape, assim como arrays
df.shape

(891, 12)

In [7]:
# Podemos acessar as colunas do DataFrame
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [22]:
#testando rename columns

df.rename(columns={'PassengerId': 'PassageiroId'}, inplace=True)

250.0
250.0

In [9]:
# Podemos conferir o tipo de dado de cada coluna
df.dtypes

PassageiroId      int64
Survived          int64
Pclass            int64
Name             object
Sex              object
Age             float64
SibSp             int64
Parch             int64
Ticket           object
Fare            float64
Cabin            object
Embarked         object
dtype: object

Essa é uma boa hora para revisarmos algumas estatísticas descritivas (para um conteúdo mais aprofundado sobre o assunto acesse http://www.portalaction.com.br/estatistica-basica/estatisticas-descritivas)

#### Funções de agregação
Assim como no NumPy podemos aplicar diversas funções de agregação aos dados. Essas funções são por padrão aplicadas a cada coluna

In [18]:
# Soma
df.sum()

PassageiroId                                               397386
Survived                                                      342
Pclass                                                       2057
Name            Braund, Mr. Owen HarrisCumings, Mrs. John Brad...
Sex             malefemalefemalefemalemalemalemalemalefemalefe...
Age                                                      21205.17
SibSp                                                         466
Parch                                                         340
Ticket          A/5 21171PC 17599STON/O2. 31012821138033734503...
Fare                                                   28693.9493
dtype: object

In [25]:
# Média
print(df.median(), "\n")
print(df.mean())

PassengerId    446.0000
Survived         0.0000
Pclass           3.0000
Age             28.0000
SibSp            0.0000
Parch            0.0000
Fare            14.4542
dtype: float64

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

#### Conferindo o número de valores nulos

Valores nulos são entradas da tabela que estão vazias (pense em uma celula do Excel sem nenhum valor dentro). O fato de um campo não estar preenchido pode ter motivos diferentes, cabe ao ciêntista de dados saber com cada caso.

É importante saber que a maioria dos algoritmos de aprendizado de máquina não trabalham com valores nulos, então é importante tratá-los na preparação dos dados.

In [18]:
# Podemos usar a funçã isna e somar para ver o numero de nulos em cada coluna
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

#### Observando estatísticas do DataFrame
Podemos observar as estatísticas de cada coluna do DataFrame utilizando o método `.describe()`

In [5]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [16]:
#comparação entre mediana e media
numeros = [1, 2 ,8 , 9, 10, 2000]
print(np.mean(numeros))
print(np.median(numeros))

# veja que a mediana é muito mais robusta, e em casos de variancias ela consegue manter uma média mais realista

338.3333333333333
8.5

### Indexando DataFrames

In [13]:
#Para essa parte iremos definir um DataFrame simples por questões didáticas
df_toy = pd.DataFrame(data= np.random.randint(100, size=(8,4)),
                      index=['a', 'b', 'c', 'd','e','f','g','h'],
                      columns=['col1', 'col2', 'col3', 'col4'])

df_toy

   col1  col2  col3  col4
a     1    98     6    15
b     0    33    55    16
c     5    75    36    93
d    77    34    20    87
e    41    80    58    97
f    28     7    70    90
g    46    44    61     3
h    30    18     2     9

In [27]:
df_toy.shape

(8, 4)

#### Indexação simples

In [41]:
# Podemos selecionar uma das colunas do nosso DataFrame
coluna_um = df_toy['Col 1']
coluna_um

a    16
b     5
c    15
d    18
e    10
f     1
g     0
h    16
Name: Col 1, dtype: int32

In [29]:
# Cada coluna é um objeto do tipo Series
type(coluna_um)

pandas.core.series.Series

In [42]:
# Ao inves de selecionar um unica coluna podemos pegar um conjunto usado uma lista
coluna_um_quatro = df_toy[['Col 1', 'Col 4']]
coluna_um_quatro

   Col 1  Col 4
a     16     12
b      5      5
c     15     17
d     18      2
e     10      9
f      1      2
g      0     14
h     16     17

In [43]:
# Usando slices dentro dos [] selecionamos um conjunto de linhas
df_toy[2:6]

   Col 1  Col 2  Col 3  Col 4
c     15     13      9     17
d     18     15      1      2
e     10     10     12      9
f      1     11     10      2

In [44]:
# Podemos selecionar linhas usando booleanos
df_toy[[True, True, False, True, False, False, False, True]]

   Col 1  Col 2  Col 3  Col 4
a     16     19     13     12
b      5     19     18      5
d     18     15      1      2
h     16     17      2     17

In [13]:
# Isso permite manipulaçoes interessantes
col1_maior_10 = df_toy['Col 1'] > 10
df_toy[col1_maior_10] # ou seja, ele captura as linhas, apenas onde a coluna 1 é maior que 10

   Col 1  Col 2  Col 3  Col 4
a     16      6     10      5
b     11      2      5     11
c     13     18     15      9
e     11     16      1      6

Essas são as formas simples de indexar um DataFrame, mas como é possível ver acaba deixando de lado muitas possibilidades, para isso temos `.loc` e `.iloc`. Vamos ver um pouco sobre cada uma delas.

#### *.loc* (indexando por label)
O index é a label de cada linha, enquanto o nome das colunas é o label de cada coluna. Podemos usar esses labels para indexar conjuntos de valores específicos do DataFrame.

In [46]:
# Podemos selecionar uma linha pela sua label
df_toy.loc['a', :]

Col 1    16
Col 2    19
Col 3    13
Col 4    12
Name: a, dtype: int32

In [47]:
# Podemos também selecionar colunas
df_toy.loc[:, 'Col 2']

a    19
b    19
c    13
d    15
e    10
f    11
g     0
h    17
Name: Col 2, dtype: int32

In [48]:
# Podemos fazer cortes de qualquer forma
df_toy.loc[['a', 'd', 'e'], ['Col 1', 'Col 3']]

   Col 1  Col 3
a     16     13
d     18      1
e     10     12

#### *.iloc* (indexando por posição)
Já no iloc a identificação de linhas e colunas é feita pela sua posição, agora sim 1ª, 2ª,... colunas e linhas. Vamos fazer exatamente as mesmas seleções do loc mas usando o iloc.

In [49]:
# Vamos selecionar a primeira linha
df_toy.iloc[0, :]

Col 1    16
Col 2    19
Col 3    13
Col 4    12
Name: a, dtype: int32

In [50]:
# Vamos selecionar a segunda coluna
df_toy.iloc[:, 1]

a    19
b    19
c    13
d    15
e    10
f    11
g     0
h    17
Name: Col 2, dtype: int32

In [14]:
# Também podemos fazer cortes de qualquer forma
df_toy.iloc[[0, 3, 4], [0, 2]]

   col1  col3
a     1     6
d    77    20
e    41    58

Tanto loc quanto iloc permitem seleção de colunas utilizando booleanos

In [54]:
# Selecionando colunas com bool
df_toy.iloc[:, [True, False, False, True]]

   Col 1  Col 4
a     16     12
b      5      5
c     15     17
d     18      2
e     10      9
f      1      2
g      0     14
h     16     17

A documentação oficial do Pandas tem uma página detalhada sobre o funcionamento da indexação: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html

### Operações em DataFrames

Certo, agora que já sabemos como manipular DataFrames podemos começar a manipular os dados que temos para fazer descobertas ou para prepará-los para um modelo de aprendizado de máquina.

In [52]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### Adicionando/Removendo colunas e linhas

- Adicionar coluna

A recomendação do Pandas é que sempre que se for alterar valores do DataFrame, seja adicionando uma coluna inteira como estamos fazendo ou mudando um único valor, devemos usar os comandos `.loc` e `.iloc`. Isso se dá ao fato de nem sempre o que é retornado de uma indexação é uma view para o valor original, em algumas situações pode ser uma cópia. Leia mais na documentação: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [53]:
#Essa forma não é recomendada: 
#df.loc[:,'Coluna Aleatoria'] = np.random.randint(100, size=(df.shape[0],))
df['Coluna Aleatoria'] = np.random.randint(100, size=(df.shape[0],))
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Coluna Aleatoria
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,77
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,91
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,80
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,71
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,88

- Remover linha

In [54]:
# Removendo uma linha (identificamos a linha pela label)
df.drop(0) # Removendo a linha
df.head() # Vendo o resultado

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Coluna Aleatoria
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,77
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,91
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,80
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,71
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,88

Ops... A linha que queriamos remover ainda está lá, isso é porque a operação de remoção (e várias operações em DataFrames) não realizam a alteração no DataFrame original, elas retornam um novo DataFrame com as alterações feitas. Podemos salvar esse retorno numa variável (até mesmo na mesma variavel que o DataFrame original) ou passar um parâmetro especial para o DataFrame dizendo para ele realizar as mudanças no próprio DataFrame.

In [56]:
# Salvando na variavel
#df.drop(0, inplace=True)

# Ou podemos indicar de um modo simples
df = df.drop(0)
df.head()

KeyError: '[0] not found in axis'

- Remover coluna

In [57]:
# Para remover uma coluna precisamos avisar que estamos querendo remover uma coluna
df = df.drop(columns=['Coluna Aleatoria'])
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

#### Tratando valores nulos
Vimos que podem existir valores nulos em nossos dados, mas não vimos o que fazer com eles. Temos basicamente três opções de como lidar com esses dados faltantes:
    - Podemos remover as linhas que possuirem dados faltantes
    - Podemos remover as colunas que possuirem dados faltantes
    - Podemos substituir dados faltantes por algum valor (a média, por exemplo)
    
Vamos analisar nosso DataFrame e ver que tipo de medida podemos adotar

In [58]:
# Vamos ver quantos valores nulos temos em cada coluna
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          686
Embarked         2
dtype: int64

In [59]:
# Talvez seja interessante saber qual porcentagem dos valores é nulo
df.isnull().sum() / df.shape[0]

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198876
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.770787
Embarked       0.002247
dtype: float64

Temos 3 colunas que apresentam valores nulos, porém cada uma delas será tratada de uma diferente.

- **Age**: Cerca de 20% dos valores dessa coluna são nulos, então vamos substituir os dados faltantes pela média dos valores da coluna
- **Cabin**: Essa coluna não possui 77% dos seus valores, portanto não há muito o que pode ser feito, vamos jogar ela toda fora.
- **Embarked**: Nesse caso só 0.2% das linhas possuem dados faltantes, vamos simplesmente remover essas linhas dos nossos dados

Temos dois métodos que vão nos ajudar a lidar com nulos `.fillna()` e `.dropna()`

`.fillna()` vai gerar uma cópia do que foi passado substituindo os valores nulos por um valor passado como parâmetro

In [66]:
# Vamos calcular a média das idades
idade_media = int(df['Age'].mean()) 
#Substituindo a coluna pela coluna com NaN sustituidos
df['Age'] = df['Age'].fillna(idade_media)

1      38.0
2      26.0
3      35.0
4      35.0
5      29.0
       ...
886    27.0
887    19.0
888    29.0
889    26.0
890    32.0
Name: Age, Length: 890, dtype: float64

In [69]:
# Vamos ver se até agora aconteceu o que queriamos
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          686
Embarked         2
dtype: int64

`.dropna()` retorna um DataFrame sem as colunas ou linhas que possuem valores nulos. 

Temos parâmetros importantes: `axis` indica se deseja remover linhas (0) ou colunas (1), `subset` indica as labels do outro eixo que podem ser consideradas para remoção, `thresh` indica o número minimo de nulos para ser removida e `inplace` indica se a operação deve ser realizada no próprio DataFrame ou uma cópia deve ser retornada.

In [71]:
# Vamos começar removendo a coluna Cabin
df.dropna(axis=1, thresh=600, inplace=True)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
5,6,0,3,"Moran, Mr. James",male,29.0,0,0,330877,8.4583,Q

In [75]:
# Agora vamos remover as linhas que possuem Embarked nulo
df.dropna(axis=0, subset=['Embarked'], inplace=True)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
5,6,0,3,"Moran, Mr. James",male,29.0,0,0,330877,8.4583,Q

In [76]:
# Conferindo se limpamos tudo
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

#### Aplicando funções em colunas
Em várias situações queremos aplicar funções em colunas, nas maioria das vezes para gerar novas colunas. Vamos ver qual é o jeito certo de fazer isso. Mas antes vamos dar uma olhada no que <span style="color:red;">não deve ser feito</span>.

Vamos supor que queremos criar uma coluna chamada 'Faixa etária' que é construida baseada na coluna 'Age'.

In [5]:
# Vamos criar uma função que faz essa transformação
def calc_faixa_etaria(idade):
    if idade < 13:
        return 'Criança'
    elif idade < 18:
        return 'Adolescente'
    elif idade < 60:
        return 'Adulto'
    else:
        return 'Idoso'

In [108]:
# A primeira ideia pode ser fazer algo assim
faixas_etarias = []
for i in range(df.shape[0]):
    idade = df.iloc[i, 5] # Age é a coluna 5
    faixa = calc_faixa_etaria(idade)
    faixas_etarias.append(faixa)

idades_dataframe = pd.DataFrame(faixas_etarias)
so_idosos = idades_dataframe[0] == 'Idoso'
idosos = idades_dataframe[so_idosos]
idosos.count()

0    25
dtype: int64

Mas isso é extremamente ineficiente quando o tamanho do DataFrame é grande!

A solução correta é usar o método `.apply()`, que aplica uma função em cada uma das entradas e retorna um `pd.Series` com todos os resultados.

In [6]:
faixas_etarias = df['Age'].apply(calc_faixa_etaria)

In [8]:
#df.loc[:, 'Faixa Etaria'] = faixas_etarias
df.drop(columns=['Faixa Etaria'], inplace=True)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Faixa Etaria
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Adulto
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Adulto
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Adulto
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Adulto
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Adulto

#### Salvando DataFrames

In [128]:
# Usamos index=False para não salvarmos a coluna de index
df.to_csv('data/titanic_editado.csv', index=False)